<template>
    <div class="empty-fragment order-view-slider">
        <div class="order-view" 
        v-for = '(item, index) in sliderFragment'
            :key = 'index'
        >   
                <div class="order-view-wrapper">
                    <h3 class="order-view-title main-title">
                        {{item.title}}
                    </h3>
                    <p class="order-view-desc small-paragraph">
                        Заказы со всех офлайн или онлайн источников попадают в единый список и распределяются между операторами. У каждого клиента единая история коммуникаций, вне зависимости от канала: будь то сайт или магазин для розницы.
                    </p>

                    <p class="order-view-desc small-paragraph">
                        Операторы работают в режиме одного окна — для просмотра товарных остатков магазина, выставления оплаты, оформления доставки и других действий не нужно покидать сервис. Управление торговлей станет эффективнее. 
                    </p>
                </div>
                <div class="order-view-img">
                    <div class="image_up">
                    </div>
                    <div class="image_body">
                    </div>
                </div>
        </div>
    </div>
</template>


<script>
export default {
    props: {
        currentSlide: {
            type: Number,
            default: () => 0
        }
    },
    data: () => ({
        orders: [
            {
                id: 1, 
                isSoon: false, 
                title: '1Больше заказов, меньше менеджеров. Обрабатывайте заказы с десятков источников в вашей CRM.',
                descone: 'Заказы со всех офлайн или онлайн источников попадают в единый список и распределяются между операторами. У каждого клиента единая история коммуникаций, вне зависимости от канала: будь то сайт или магазин для розницы.',
                desctwo: 'Операторы работают в режиме одного окна — для просмотра товарных остатков магазина, выставления оплаты, оформления доставки и других действий не нужно покидать сервис. Управление торговлей станет эффективнее. ',
                img: 'name' 
            },
            {
                id: 2, 
                isSoon: false, 
                title: '2меньше менеджеров. Обрабатывайте заказы с десятков источников в вашей CRM.',
                descone: 'Заказы со всех офлайн или онлайн источников попадают в единый список и распределяются между операторами. У каждого клиента единая история коммуникаций, вне зависимости от канала: будь то сайт или магазин для розницы.',
                desctwo: 'Операторы работают в режиме одного окна — для просмотра товарных остатков магазина, выставления оплаты, оформления доставки и других действий не нужно покидать сервис. Управление торговлей станет эффективнее. ',
                img: 'name' 
            },
            {
                id: 3, 
                isSoon: false, 
                title: '3Больше заказов, меньше менеджеров. Обрабатывайте заказы с десятков источников в вашей CRM.',
                descone: 'Заказы со всех офлайн или онлайн источников попадают в единый список и распределяются между операторами. У каждого клиента единая история коммуникаций, вне зависимости от канала: будь то сайт или магазин для розницы.',
                desctwo: 'Операторы работают в режиме одного окна — для просмотра товарных остатков магазина, выставления оплаты, оформления доставки и других действий не нужно покидать сервис. Управление торговлей станет эффективнее. ',
                img: 'name' 
            },
            {
                id: 4, 
                isSoon: false, 
                title: '4Больше заказов, меньше. заказы с десятков источников в вашей CRM.',
                descone: 'Заказы со всех офлайн или онлайн источников попадают в единый список и распределяются между операторами. У каждого клиента единая история коммуникаций, вне зависимости от канала: будь то сайт или магазин для розницы.',
                desctwo: 'Операторы работают в режиме одного окна — для просмотра товарных остатков магазина, выставления оплаты, оформления доставки и других действий не нужно покидать сервис. Управление торговлей станет эффективнее. ',
                img: 'name' 
            }
        ],
        sliderFragment: [
            {
                id: 1, 
                isSoon: false, 
                title: '1Больше заказов, меньше менеджеров. Обрабатывайте заказы с десятков источников в вашей CRM.',
                descone: 'Заказы со всех офлайн или онлайн источников попадают в единый список и распределяются между операторами. У каждого клиента единая история коммуникаций, вне зависимости от канала: будь то сайт или магазин для розницы.',
                desctwo: 'Операторы работают в режиме одного окна — для просмотра товарных остатков магазина, выставления оплаты, оформления доставки и других действий не нужно покидать сервис. Управление торговлей станет эффективнее. ',
                img: 'name' 
            },
        ],
        current: 1
    }),
    watch: {
        currentSlide() {
            this.orders.map(item => {
                if (item.id === this.currentSlide) {
                    this.sliderFragment.push(item)
                    document.querySelector('.order-view-slider').style.cssText = `transform: translate(-${this.current*100 + this.current*10}%, 0)`
                    this.current ++
                }
            })
        }
    }
    
}
</script>


<style lang="scss">

</style>