<template>
    <div class="retail-items">
        <div class="retail-item"
            v-for='(item, index) in items'
            :key= 'index'
        >
            <div class="items-quadre">
            </div>

            <div class="items-title">
                {{item.title}}
            </div>

            <p class="items-desc small-paragraph">
                {{item.desc}}
            </p>
        </div>
    </div>
</template>

<script>
export default {
    data: () => ({
        items: [
            {title: 'В разы повысьте вашу производительность', desc: 'То, что раньше занимало полчаса, вы сможете сделать в два клика.  Сервис сделает сложные расчеты, сформирует пакет документов, выставит счет, отправит письмо и смс.'},
            {title: 'Принимайте верные решения за счет аналитики', desc: 'То, что раньше занимало полчаса, вы сможете сделать в два клика.  Сервис сделает сложные расчеты, сформирует пакет документов, выставит счет, отправит письмо и смс.'},
            {title: 'Предоставьте вашим клиентам лучший сервис', desc: 'То, что раньше занимало полчаса, вы сможете сделать в два клика.  Сервис сделает сложные расчеты, сформирует пакет документов, выставит счет, отправит письмо и смс.'}
        ]
    })
}
</script>
